title: Sysmon - schtasks.exe Executed
id: 9f2b0f53-2f4a-4c2e-8d8a-f6a7f7f8d9a0
status: experimental
author: RoninSec
date: 2025-08-24
logsource:
  product: windows
  service: sysmon
detection:
  sel_base:
    EventID: 1
  sel_proc:
    Image|endswith: '\schtasks.exe'
  condition: sel_base and sel_proc
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: medium
